## Importing Pandas

In [2]:
import pandas as pd

## Pandas Data Structures

### Dataframe

In [4]:
data = {'Country': ['Belgium', 'India', 'Brazil'],

        'Capital': ['Brussels', 'New Delhi', 'Brasília'],

        'Population': [11190846, 1303171035, 207847528]}

In [5]:
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])

df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

## Dropping

In [6]:
s.drop(['a', 'c']) #Drop values from rows (axis=0)

b   -5
d    4
dtype: int64

In [13]:
df.drop(['Country', 'Capital'], axis=1) #Drop values from columns(axis=1)

   Population
0    11190846
1  1303171035
2   207847528

# Sort

In [26]:
df.sort_values(by='Country') #Sort by the values along an axis

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [27]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

## I/O

Pandas has different functions to deal with different datasets example:
- Excel files
- SQL databases

## Read and Write to CSV

In [3]:
df = pd.read_csv(r'D:\udacity mentorship\abdullah\7\amazon EDA\Amazon Top 50 Books.csv')
df

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350.0,$8.00,$8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052.0,$22.00,$22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979.0,$15.00,$15,2018,Non Fiction
3,1984,NaN,4.7,70425.0,$7.48,$8,2021,Fiction
4,1984 (Signet Classics),George Orwell,4.7,21424.0,$6.00,$6,2017,Fiction
...,...,...,...,...,...,...,...,...
645,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,NaN,9413.0,$8.00,NaN,2019,Fiction
646,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2016,Non Fiction
647,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2017,Non Fiction
648,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2018,Non Fiction
649,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2019,Non Fiction

In [30]:
df.to_csv('myDataFrame.csv')

## Selection

### Getting

In [6]:
df['Author'][4]#Get subset of a DataFrame

'George Orwell'

### Selecting, Boolean Indexing & Setting

#### By Position

In [37]:
df.iloc[2:5,2:5] #Select single value by row & column

   User Rating  Reviews   Price
2          4.7  18979.0  $15.00
3          4.7  70425.0   $7.48
4          4.7  21424.0   $6.00

#### By Label

In [38]:
df.loc[0:5, ['Name', 'Author']] #Select single value by row & column labels

                                                Name                    Author
0                      10-Day Green Smoothie Cleanse                  JJ Smith
1                                  11/22/63: A Novel              Stephen King
2            12 Rules for Life: An Antidote to Chaos        Jordan B. Peterson
3                                               1984                       NaN
4                             1984 (Signet Classics)             George Orwell
5  5,000 Awesome Facts (About Everything!) (Natio...  National Geographic Kids

### Filtering

In [43]:
df[df['Reviews']>100000] #Use filter to adjust DataFrame

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
33,Atomic Habits: An Easy & Proven Way to Build G...,James Clear,4.8,104159.0,$11.98,$12,2021,Non Fiction
226,It Ends with Us: A Novel (1),Colleen Hoover,4.7,141748.0,$10.26,$11,2021,Fiction
421,"The Boy, the Mole, the Fox and the Horse",Charlie Mackesy,NaN,106658.0,$10.35,$11,2021,Non Fiction
455,The Four Winds: A Novel,Kristin Hannah,4.5,117146.0,$13.79,$14,2021,Fiction
496,The Last Thing He Told Me: A Novel,Laura Dave,4.3,107449.0,$13.09,$14,NaN,Fiction
513,The Midnight Library: A Novel,Matt Haig,4.3,193482.0,$13.29,$14,2021,Fiction
539,The Seven Husbands of Evelyn Hugo: A Novel,Taylor Jenkins Reid,4.6,111053.0,$9.42,$10,2021,Fiction
633,Where the Crawdads Sing,Delia Owens,4.8,120727.0,$9.00,$9,2020,Fiction

In [7]:
df.query('Reviews >100000')

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
33,Atomic Habits: An Easy & Proven Way to Build G...,James Clear,4.8,104159.0,$11.98,$12,2021,Non Fiction
226,It Ends with Us: A Novel (1),Colleen Hoover,4.7,141748.0,$10.26,$11,2021,Fiction
421,"The Boy, the Mole, the Fox and the Horse",Charlie Mackesy,NaN,106658.0,$10.35,$11,2021,Non Fiction
455,The Four Winds: A Novel,Kristin Hannah,4.5,117146.0,$13.79,$14,2021,Fiction
496,The Last Thing He Told Me: A Novel,Laura Dave,4.3,107449.0,$13.09,$14,NaN,Fiction
513,The Midnight Library: A Novel,Matt Haig,4.3,193482.0,$13.29,$14,2021,Fiction
539,The Seven Husbands of Evelyn Hugo: A Novel,Taylor Jenkins Reid,4.6,111053.0,$9.42,$10,2021,Fiction
633,Where the Crawdads Sing,Delia Owens,4.8,120727.0,$9.00,$9,2020,Fiction

## Retrieving Series/DataFrame Information

### Basic Information

In [47]:
df.head() # return first 5 rows

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350.0,$8.00,$8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052.0,$22.00,$22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979.0,$15.00,$15,2018,Non Fiction
3,1984,NaN,4.2,70425.0,$7.48,$8,2021,Fiction
4,1984 (Signet Classics),George Orwell,4.7,21424.0,$6.00,$6,2017,Fiction

In [48]:
df.tail() # return last 5 rows

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
645,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,NaN,9413.0,$8.00,NaN,2019,Fiction
646,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2016,Non Fiction
647,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2017,Non Fiction
648,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2018,Non Fiction
649,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331.0,$8.00,$8,2019,Non Fiction

In [49]:
df.shape #(rows,columns)

(650, 8)

In [50]:
df.index #Describe index

RangeIndex(start=0, stop=650, step=1)

In [51]:
df.columns #Describe DataFrame columns

Index(['Name', 'Author', 'User Rating', 'Reviews', 'Price', 'Price_r', 'Year',
       'Genre'],
      dtype='object')

In [52]:
df.info() #Info on DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 650 entries, 0 to 649
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         641 non-null    object
 1   Author       642 non-null    object
 2   User Rating  637 non-null    float64
 3   Reviews      635 non-null    float64
 4   Price        641 non-null    object
 5   Price_r      642 non-null    object
 6   Year         630 non-null    object
 7   Genre        627 non-null    object
dtypes: float64(2), object(6)
memory usage: 40.8+ KB

In [54]:
df.isnull().sum()

Name            9
Author          8
User Rating    13
Reviews        15
Price           9
Price_r         8
Year           20
Genre          23
dtype: int64

### Summary

In [55]:
df['Reviews'].sum() #Sum of values

10941850.0

In [56]:
df['Reviews'].min()

37.0

In [57]:
df['User Rating'].max()

4.9

In [58]:
df.describe() #Summary statistics

       User Rating        Reviews
count   637.000000     635.000000
mean      4.634066   17231.259843
std       0.223293   20803.655436
min       3.300000      37.000000
25%       4.500000    4832.500000
50%       4.700000    9967.000000
75%       4.800000   22288.000000
max       4.900000  193482.000000

In [59]:
df['User Rating'].mean() #Mean of values

4.634065934065941

In [60]:
df['Reviews'].median() #Median of values

9967.0

## Applying Functions

In [77]:
f = lambda x: x*2

In [78]:
df['User Rating'] = df['User Rating'].apply(f)
df.head()

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,9.4,17350.0,$8.00,$8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,9.2,2052.0,$22.00,$22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,9.4,18979.0,$15.00,$15,2018,Non Fiction
3,1984,NaN,9.4,70425.0,$7.48,$8,2021,Fiction
4,1984 (Signet Classics),George Orwell,9.4,21424.0,$6.00,$6,2017,Fiction

## Data Alignment

### Arithmetic Operations with Fill Methods
You can also do the internal data alignment yourself with
 the help of the fillna method:

## Missing Data

In [85]:
df.dropna() #Drop NaN values

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,9.4,17350.0,$8.00,$8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,9.2,2052.0,$22.00,$22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,9.4,18979.0,$15.00,$15,2018,Non Fiction
4,1984 (Signet Classics),George Orwell,9.4,21424.0,$6.00,$6,2017,Fiction
5,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,9.6,7665.0,$12.00,$12,2019,Non Fiction
...,...,...,...,...,...,...,...,...
644,Wonder,R. J. Palacio,9.6,21625.0,$9.00,$9,2017,Fiction
646,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2016,Non Fiction
647,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2017,Non Fiction
648,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2018,Non Fiction
649,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2019,Non Fiction

In [86]:
df.dropna(subset = ['Author', 'Name'], inplace = True)

In [87]:
df.isnull().sum()

Name            0
Author          0
User Rating    13
Reviews        15
Price           8
Price_r         8
Year           20
Genre          22
dtype: int64

In [88]:
df['User Rating'].fillna(df['User Rating'].mean()[0]) #Fill NaN values with a predetermined value

0      9.4
1      9.2
2      9.4
4      9.4
5      9.6
      ...
645    9.6
646    9.4
647    9.4
648    9.4
649    9.4
Name: User Rating, Length: 633, dtype: float64

In [89]:
df['Author'].replace("Jen Sincero", "jen") #Replace values with others

0                      JJ Smith
1                  Stephen King
2            Jordan B. Peterson
4                 George Orwell
5      National Geographic Kids
                 ...
645                 Jeff Kinney
646                         jen
647                         jen
648                         jen
649                         jen
Name: Author, Length: 633, dtype: object

## Duplicate Data

In [90]:
s3.unique() #Return unique values

array([ 7, -2,  3])

In [91]:
df.duplicated('Author').sum() #Check duplicates

346

In [92]:
df.duplicated().sum() #Check index duplicates

0

In [95]:
# if we specified cloumn author then it will check for rows with the same Author 
# and it will remove all of them

df.drop_duplicates('Author') #Drop duplicates

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,9.4,17350.0,$8.00,$8,2016,Non Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,9.4,18979.0,$15.00,$15,2018,Non Fiction
4,1984 (Signet Classics),George Orwell,9.4,21424.0,$6.00,$6,2017,Fiction
5,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,9.6,7665.0,$12.00,$12,2019,Non Fiction
7,A Game of Thrones / A Clash of Kings / A Storm...,George R. R. Martin,9.4,19735.0,$30.00,$30,2014,Fiction
...,...,...,...,...,...,...,...,...
638,Winter of the World: Book Two of the Century T...,Ken Follett,9.0,10760.0,$15.00,$15,2012,Fiction
639,Women Food and God: An Unexpected Path to Almo...,Geneen Roth,8.4,1302.0,$11.00,$11,2010,Non Fiction
644,Wonder,R. J. Palacio,9.6,21625.0,$9.00,$9,2017,Fiction
645,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,NaN,9413.0,$8.00,NaN,2019,Fiction
649,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2019,Non Fiction

In [96]:
# if we haven't specify a column so in order for two rows to be duplicated they need to have 
# same values  in every column and then we will remove all the duplicates

df.drop_duplicates() #Drop duplicates

,Name,Author,User Rating,Reviews,Price,Price_r,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,9.4,17350.0,$8.00,$8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,9.2,2052.0,$22.00,$22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,9.4,18979.0,$15.00,$15,2018,Non Fiction
4,1984 (Signet Classics),George Orwell,9.4,21424.0,$6.00,$6,2017,Fiction
5,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,9.6,7665.0,$12.00,$12,2019,Non Fiction
...,...,...,...,...,...,...,...,...
645,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,NaN,9413.0,$8.00,NaN,2019,Fiction
646,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2016,Non Fiction
647,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2017,Non Fiction
648,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2018,Non Fiction
649,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,9.4,14331.0,$8.00,$8,2019,Non Fiction

# More advanced check on your own time

## Grouping Data

In [101]:
df.groupby(by=['Author'])['User Rating'].max()

Author
Abraham Verghese      9.2
Adam Gasiewski        8.8
Adam Mansbach         9.6
Adam Silvera          9.2
Adam Wallace          9.6
                     ...
William P. Young      9.2
Wizards RPG Team      9.6
Wonder House Books    9.2
Workman Publishing    9.6
Zhi Gang Sha          9.2
Name: User Rating, Length: 287, dtype: float64

In [102]:
df.groupby(by=['Author','Year'])['Name'].count()

Author              Year
Abraham Verghese    2010    1
                    2011    1
Adam Gasiewski      2017    1
Adam Mansbach       2011    1
Adam Silvera        2021    1
                           ..
Wizards RPG Team    2019    1
Wonder House Books  2021    1
Workman Publishing  2020    2
Zhi Gang Sha        2009    1
                    2013    1
Name: Name, Length: 554, dtype: int64

## Combining Data

In [103]:
data1 = {'Country': ['Belgium','Egypt', 'India', 'Brazil'],

        'Population': [11190846, 106546324, 1303171035, 207847528]}

data2 = {'Country': ['Belgium', 'Egypt', 'Germany', 'Spain'],

        'Averag Salary': [3758, 503, 3810, 2710]}

df1 = pd.DataFrame(data1, columns=['Country', 'Population'])

df2 = pd.DataFrame(data2, columns=['Country', 'Averag Salary'])

In [104]:
df1.head()

   Country  Population
0  Belgium    11190846
1    Egypt   106546324
2    India  1303171035
3   Brazil   207847528

In [105]:
df2.head()

   Country  Averag Salary
0  Belgium           3758
1    Egypt            503
2  Germany           3810
3    Spain           2710

In [106]:
# only countries in df1 are included

pd.merge(df1, df2, how='left', on='Country')

   Country  Population  Averag Salary
0  Belgium    11190846         3758.0
1    Egypt   106546324          503.0
2    India  1303171035            NaN
3   Brazil   207847528            NaN

In [107]:
# only countries in df2 are included

pd.merge(df1, df2, how='right', on='Country')

   Country   Population  Averag Salary
0  Belgium   11190846.0           3758
1    Egypt  106546324.0            503
2  Germany          NaN           3810
3    Spain          NaN           2710

In [108]:
# only countries that are in both df1 and df2 are included

pd.merge(df1, df2, how='inner', on='Country')

   Country  Population  Averag Salary
0  Belgium    11190846           3758
1    Egypt   106546324            503

In [109]:
# all countries that are in df1 or df2 are included

pd.merge(df1, df2, how='outer', on='Country')

   Country    Population  Averag Salary
0  Belgium  1.119085e+07         3758.0
1    Egypt  1.065463e+08          503.0
2    India  1.303171e+09            NaN
3   Brazil  2.078475e+08            NaN
4  Germany           NaN         3810.0
5    Spain           NaN         2710.0